FROM python:3.11-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все файлы проекта в контейнер
COPY . .

# Открываем порт 50345 для внешнего доступа
EXPOSE 50345

# Запускаем приложение. 
# ВАЖНО: host должен быть 0.0.0.0, чтобы принимать запросы извне контейнера.
# Переопределяем порт на 50345.
CMD ["uvicorn", "app:app", "--host", "0.0.0.0", "--port", "50345"]
